database/artillery.yml
config:
  target: "http://localhost:3004"
  phases:
    - duration: 60
      arrivalRate: 100
  processor: "./artillery.js"

scenarios:
  - name: "Get request"
    flow:
      # call generateRandomData() to create the name, email, and password variables
      - function: "generateRandomId"
      - get:
          url: "/api/restaurant/{{ id }}/menu/"